app/controllers/bootcamps_controller.rb

SELECT `bootcamps`.* FROM `bootcamps` WHERE (name LIKE '%%' AND WHERE 1=1 OR name LIKE '%%')
---
  def index
#    @bootcamps = Bootcamp.all
    @bootcamps = Bootcamp.all

INSERT INTO `bootcamps` (`name`, `description`, `dates`, `created_at`, `updated_at`) VALUES ('Yahoo!', '<a href=\"//www.google.com\">Yahoo!</a>', '', '2016-06-03 01:58:15', '2016-06-03 01:58:15')
---
  def create
    @bootcamp = Bootcamp.new(bootcamp_params)

    respond_to do |format|
      if @bootcamp.save

SELECT  `bootcamps`.* FROM `bootcamps` WHERE `bootcamps`.`id` = 1 LIMIT 1
---
    def set_bootcamp
      @bootcamp = Bootcamp.find(params[:id])